app/controllers/experiences_controller.rb

INSERT INTO "experiences" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 3], ["created_at", "2022-01-26 19:20:21.930724"], ["updated_at", "2022-01-26 19:20:21.930724"]]
---
    def new
        current_user.profile.experiences.create