app/controllers/profiles_controller.rb

    def update
        updated_profile_params = update_array_attributes_in_params(profile_params)
        @profile = current_user.profile
        @profile.save
        if @profile.update(updated_profile_params)
---
UPDATE "profiles" SET "career_highlights" = $1, "primary_skills" = $2, "secondary_skills" = $3, "updated_at" = $4 WHERE "profiles"."id" = $5  [["career_highlights", "{SDE}"], ["primary_skills", "{C++}"], ["secondary_skills", "{Java}"], ["updated_at", "2022-01-26 14:41:32.838909"], ["id", 14]]
UPDATE "profiles" SET "name" = $1, "job_title" = $2, "total_experience" = $3, "overview" = $4, "updated_at" = $5 WHERE "profiles"."id" = $6  [["name", "{}"], ["job_title", "{}"], ["total_experience", "{}"], ["overview", "{DE}"], ["updated_at", "2022-01-27 08:30:57.264780"], ["id", 6]]