app/controllers/projects_controller.rb

    def new
        current_user.profile.projects.create
---
INSERT INTO "projects" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 6], ["created_at", "2022-01-27 08:33:55.474455"], ["updated_at", "2022-01-27 08:33:55.474455"]]