app/controllers/registrations_controller.rb

INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 12], ["created_at", "2022-01-26 09:21:14.872996"], ["updated_at", "2022-01-26 09:21:14.872996"]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "educations" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 3], ["created_at", "2022-01-26 09:21:14.977063"], ["updated_at", "2022-01-26 09:21:14.977063"]]
INSERT INTO "experiences" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 5], ["created_at", "2022-01-27 08:10:15.822759"], ["updated_at", "2022-01-27 08:10:15.822759"]]
INSERT INTO "projects" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 6], ["created_at", "2022-01-27 08:16:49.230501"], ["updated_at", "2022-01-27 08:16:49.230501"]]
---
    def create
        @user = User.new(user_params)
        @user.profile = Profile.new

        if @user.save
            session[:user_id] = @user.id
            @user.profile.educations.create
            @user.profile.experiences.create
            @user.profile.projects.create